<template>
  <div>
  <a-list :grid="{ gutter: 16, column: 4 }" :data-source="$store.state.data">
    <a-list-item slot="renderItem" slot-scope="item">
      <a-card :title="item.title">
        <From 
          :id="item.id" 
          :DataSource = item.result
          :count = item.count
          >
          </From>
      </a-card>
    </a-list-item>
  </a-list>

  <a-button type="primary" @click="association">核心要素分析</a-button>
  
    
  <hr>
  <div ref="result" style="display:none">
    <a-tabs type="card" >

      <a-tab-pane key="1" tab="结构域 (Structrue) 需求要素">
        <div v-for="item in data[0].result" :key="item.key">
          <a-card :title="item.name">
            
            <MultFrom
            :data = "formatData(item.name)"
            @choseresult="getresult"
            
            ></MultFrom>
            <a-button type="primary" @click="anaylsisResultFromMult">重要关键词分析</a-button>

          </a-card>
        </div>
      </a-tab-pane>


      <a-tab-pane key="2" tab="功能域-行为(Function-Action) 需求要素">
        <div v-for="item in data[1].result" :key="item.key">
          <a-card :title="item.name">
            
            <MultFrom
            :data = "formatData(item.name)"
            @choseresult="getresult"
            
            ></MultFrom>

            <a-button type="primary" @click="anaylsisResultFromMult">重要关键词分析</a-button>
          </a-card>
        </div>
      </a-tab-pane>

      <a-tab-pane key="3" tab="功能域-对象(Function-Object) 需求要素">
        <div v-for="item in data[2].result" :key="item.key">
          <a-card :title="item.name">
            
            <MultFrom
            :data = "formatData(item.name)"
            @choseresult="getresult"
            
            ></MultFrom>

            <a-button type="primary" @click="anaylsisResultFromMult">重要关键词分析</a-button>
          </a-card>
        </div>
      </a-tab-pane>

      <a-tab-pane key="4" tab="场景域 (scene) 需求要素">
        <div v-for="item in data[3].result" :key="item.key">
          <a-card :title="item.name">
            
            <MultFrom
            :data = "formatData(item.name)"
            @choseresult="getresult"
            
            ></MultFrom>

            <a-button type="primary" @click="anaylsisResultFromMult">重要关键词分析</a-button>
          </a-card>
        </div>
      </a-tab-pane>
  </a-tabs>
  </div>
  

  <!-- 抽屉 -->
  <a-drawer
      title="一般关键词界面"
      placement="bottom"
      :height=600
      :closable="false"
      :visible="visible"
      :after-visible-change="afterVisibleChange"
      @close="onClose"
    >

      <Fromdraw
      :resultFromAssociation = "resultToDrawer"
      :graphsimdictfromassociation = "graphsimdictToDrawer"
      :init = visible
      ></Fromdraw>
    </a-drawer>
  </div>


</template>

<script>
import From from '@/components/From-style.vue';
import MultFrom from '@/components/mult-From.vue'
import Fromdraw from '@/components//From-drawer.vue'
import {mapGetters,mapState} from 'vuex'







export default {

  
  data() {
    return {
      //传送给Menu的数据
      semantic_sim_dict:'',

      description:'',

      resultFromMultform:'',

      visible: false,

      resultToDrawer:'',

      //访问api后传回的数据
      semantic_sim_dict1 : {
      '上下料': 
      {'FA':
        {'上下料': 1.0,
        '下料': 0.9897,
        '上料': 0.988,
        '混料': 0.98,
        '均料': 0.979},
      'FO':
        {'上下料': 1.0,
        '下料': 0.9897,
        '上料': 0.988,
        '带料': 0.9814,
        '下料板': 0.98},
      'S':
        {'上下料': 1.0,
        '上下料结': 0.991,
        '上下料口': 0.9893,
        '上下料门': 0.9893,
        '上料': 0.988},
      'scene':
        {}
      },

      '纸盒': 
      {'FA': 
        {'引纸': 0.982,
        '贴纸': 0.981,
        '膜袋': 0.9795,
        '夹纸': 0.979,
        '供纸': 0.979},
      'FO': 
        {'纸盒': 1.0,
        '纸箱': 0.987,
        '纸袋': 0.985,
        '瓦楞纸箱': 0.984,
        '楞纸箱': 0.983},
      'S': 
        {'纸盒': 1.0,
        '放纸盒': 0.994,
        '异形纸盒': 0.9937,
        '碎纸盒': 0.993,
        '卷纸盒': 0.9927},
      'scene':
        {}
      },

      '机械手': 
      {'FA': 
        {'移动机器人': 0.984,
        '手持': 0.9717,
        '夹具': 0.971,
        '握持': 0.9697,
        '配送机器人': 0.9688},
      'FO': 
        {'机械手': 1.0,
        '机械臂': 0.992,
        '机械': 0.9897,
        '机械手组件': 0.9893,
        '软体机器人': 0.9893},
      'S': 
        {'机械手': 1.0,
        '式机械手': 0.997,
        '机械手辅机': 0.9966,
        '料机械手': 0.9966,
        '联机械手': 0.9966},
      'scene':
          {}
        }
      },

      graphsimdictToDrawer :'',

      graph_sim_dict : {
        'FA-上下料': {'FA': {'裁板': 0.08333333333333333, '车削': 0.05}, 'FO': {'螺纹件': 0.08333333333333333, '珩磨': 0.08333333333333333}, 'S': {'自动上下料机': 0.16666666666666666, '自动上下料装置': 0.10526315789473684},'scene':{}},

        'FA-下料': {'FA': {'划丝': 0.024390243902439025, '上料': 0.016260162601626018}, 'FO': {'虎钳': 0.024691358024691357, '枣皮': 0.024390243902439025}, 'S': {'下料装置': 0.07650273224043716, '自动上下料装置': 0.058823529411764705},'scene':{}},

        'FA-上料': {'FA': {'下料': 0.016260162601626018, '复合': 0.010101010101010102}, 'FO': {'工件': 0.016853932584269662, '磁瓦': 0.011627906976744186}, 'S': {'上料装置': 0.1237785016286645, '自动上料装置': 0.06179775280898876},'scene':{}},

        'FO-上下料': {'FA': {'输送': 0.0018832391713747645}, 'FO': {}, 'S': {'运料车': 0.5, '上管部': 0.5, '下管部': 0.5, '横通道': 0.14285714285714285, '龙门吊': 0.05263157894736842, '竖井': 0.047619047619047616, '开口部': 0.0028011204481792717, '台阶': 0.001694915254237288, '盖板': 0.00043402777777777775}}, 

        'FO-下料': {'FA': {'抹平': 0.0625, '压榨': 0.05, '预制': 0.02040816326530612, '灌装': 0.015151515151515152, '筛分': 0.013513513513513514, '下料': 0.011363636363636364, '收纳': 0.007407407407407408, '组装': 0.0031645569620253164, '冷却': 0.0017211703958691911, '制造': 0.0005927682276229994, '控制': 0.00035938903863432165}, 'FO': {'线圈支架': 0.1111111111111111, '生素': 0.1111111111111111, '雕刻': 0.06666666666666667, '铜管': 0.05555555555555555, '墙板': 0.029411764705882353, '水果': 0.013157894736842105}, 'S': {'上下料控制': 0.25, '监控显示': 0.125, '盖子弹簧': 0.125, '夹罐板': 0.125, '座体夹持块': 0.125, '出料滑柱': 0.125, '位置确认杆': 0.125, '夹爪缓冲弹簧': 0.125, '存放箱盖子': 0.125, '罐子固定臂': 0.125, '下料灌装装置': 0.125, '供料z轴机械手': 0.125, '夹持凹口': 0.125, '存料箱支撑臂': 0.125, '夹取箱电机': 0.125, '下料收纳装置': 0.125, '轴机': 0.125, '机床控制子系统': 0.125, '夹取箱电机基': 0.125, '罐子挡板触碰柱': 0.125, '料轴主体': 0.125, '夹罐': 0.125, '双y轴机床': 0.125, '配合套升降气缸': 0.125, '罐子缓冲基座': 0.125, '孔位检测口': 0.125, '模组轴控': 0.125, '螺旋扇叶支撑臂': 0.125, '模组组件': 0.125, '夹板弹簧基座': 0.125, '双y轴雕刻': 0.125, '移动滑柱弹簧': 0.125, '人机交互单': 0.125, '座体取放安装座': 0.125, '出料滑柱弹簧': 0.125, '上下料控制子系统': 0.125, '罐子挡板滑柱': 0.125, '夹爪缓冲套筒': 0.125, '缓冲辊子': 0.125, '夹取箱电机基座': 0.125, '出料挡板触碰柱': 0.125, '孔位检测器': 0.125, '线圈支架组装设备': 0.125, '上下料控制系统': 0.125, '上下料工作': 0.125, '合格品输送块': 0.125, '合格品输送装置': 0.125, '二维码扫描识别设备': 0.125, '上下料工作区': 0.125, '监控示教控制子系统': 0.125}},

        'FO-上料': {'FA': {'堆叠': 0.034482758620689655, '降噪': 0.011904761904761904, '传送': 0.007407407407407408, '提升': 0.006711409395973154, '定位': 0.0013020833333333333, '加工': 0.0004144218814753419, '检测': 0.00035298270384751147}, 'FO': {'轴承圈': 0.16666666666666666, '料盘': 0.14285714285714285, '送料': 0.07142857142857142, '锻件': 0.05, '异常': 0.037037037037037035}, 'S': {'端夹紧组件': 0.2, '侧夹紧组件': 0.2, '发射光线': 0.2, '检测支架组件': 0.2, '旋转摆动组件': 0.2, '框体连杆': 0.2, '侧夹紧块': 0.2, '正旋转螺纹': 0.2, '支撑座组': 0.2, '端夹紧块': 0.2, '放置床': 0.2, '上料工段降噪装置': 0.2, '锻件本体': 0.2, '上料送料提升装置': 0.2, '太阳能层板': 0.2, '网形筒': 0.2, '料防堆叠装置': 0.2, '施工升降机': 0.16666666666666666, '料盘传送系统': 0.16666666666666666, '电线夹': 0.16666666666666666, '减震滑槽': 0.16666666666666666, '移动固定块': 0.14285714285714285, '上料定位装置': 0.14285714285714285, '中频加热炉': 0.14285714285714285, '外顶板': 0.14285714285714285, '承托滑板': 0.14285714285714285, '通缝': 0.14285714285714285, '支撑座组件': 0.14285714285714285, '前轴锻件': 0.14285714285714285, '垂直块': 0.125, '反旋螺纹': 0.125, '楼房': 0.1111111111111111, '降噪板': 0.1, '安装结': 0.07692307692307693, '减震滑块': 0.07692307692307693, '水平块': 0.06666666666666667, '伸缩口': 0.05555555555555555, '送料箱': 0.05555555555555555, '导座': 0.05263157894736842, '双螺杆': 0.047619047619047616, '拉条': 0.047619047619047616, '下层板': 0.041666666666666664, '降噪装置': 0.041666666666666664, '轴承圈': 0.04, '传送通道': 0.037037037037037035, '铰杆': 0.03571428571428571, '门形架': 0.03571428571428571, '矩形凸起': 0.03571428571428571, '上层板': 0.03225806451612903, '传输通道': 0.03225806451612903}},

        'S-上下料': {'FA': {'储料': 0.14285714285714285, '电镀': 0.020833333333333332, '整形': 0.01694915254237288, '下料': 0.012048192771084338, '控制': 0.0001798237727027513}, 'FO': {'钢片': 0.14285714285714285, '雕刻': 0.1, '下料': 0.1}, 'S': {'监控显示': 0.3333333333333333, '长方形框架底座': 0.3333333333333333, '前后移动驱动电机': 0.3333333333333333, '下料传送及储存架': 0.3333333333333333, '水平移动链条驱动电机': 0.3333333333333333, '前端输出轴': 0.3333333333333333, '储料基座': 0.3333333333333333, '活塞环电镀穿接芯棒': 0.3333333333333333, '供料z轴机械手': 0.3333333333333333, '升降轿箱': 0.3333333333333333, 'u形支口': 0.3333333333333333, '活塞环支撑托': 0.3333333333333333, '活塞环电镀生产线': 0.3333333333333333, '变压器钢片整形装置': 0.3333333333333333, '右水平移动链条': 0.3333333333333333, '轴机': 0.3333333333333333, '机床控制子系统': 0.3333333333333333, '过渡链条': 0.3333333333333333, '前后移动驱动齿轮': 0.3333333333333333, '后垂直传动环行链条': 0.3333333333333333, '双y轴机床': 0.3333333333333333, '后端水平环形传送链条组': 0.3333333333333333, '模组轴控': 0.3333333333333333, '模组组件': 0.3333333333333333, '双y轴雕刻': 0.3333333333333333, '人机交互单': 0.3333333333333333, '上下料控制子系统': 0.3333333333333333, '转接提升框架': 0.3333333333333333, '上下料控制系统': 0.3333333333333333, '上下料工作': 0.3333333333333333, '前长方形垂直框架': 0.3333333333333333, '二维码扫描识别设备': 0.3333333333333333, '上下料工作区': 0.3333333333333333, '双端输出减速器': 0.3333333333333333, '监控示教控制子系统': 0.3333333333333333, '预电镀活塞环': 0.3333333333333333, '水平环形传送链条组': 0.3333333333333333, '立柱式箱形框架': 0.3333333333333333, '垂直升降导轨': 0.3333333333333333, '整形台': 0.3333333333333333, '上下升降滑块': 0.3333333333333333, '电镀活塞环': 0.3333333333333333, 'u形提升吊耳': 0.3333333333333333, '机床加工区': 0.3333333333333333, '前垂直传动环行链条': 0.3333333333333333, '升降轿箱链条连接座': 0.3333333333333333, '运料模组': 0.3333333333333333, '抽检位': 0.3333333333333333, '吊装碗': 0.3333333333333333, '下料传送及': 0.3333333333333333}},

        'S-上下料结': {'FA': {'切割': 0.001466275659824047}, 'FO': {}, 'S': {'上下料导轨': 0.5, '导轨基座': 0.3333333333333333, '负压接口': 0.3333333333333333, '驱动轨道': 0.125, '下密封盖': 0.1111111111111111, '上密封盖': 0.1111111111111111, '自动上下料装置': 0.1111111111111111, '升降模组': 0.09090909090909091, '环形侧壁': 0.08333333333333333, '进出料口': 0.07692307692307693, '激光切割头': 0.04, '激光切割机': 0.03125, '负压装置': 0.029411764705882353, '密封壳体': 0.027777777777777776, '密封腔体': 0.02631578947368421, '粉尘': 0.021739130434782608, '通风装置': 0.02, '切割腔': 0.017857142857142856, '转运装置': 0.017857142857142856, '料盒': 0.015384615384615385, '监测装置': 0.012658227848101266, '机柜': 0.009900990099009901, '滤芯': 0.007194244604316547, '电缸': 0.007042253521126761, '密封门': 0.006493506493506494, '封盖': 0.0038314176245210726, '升降组件': 0.0035587188612099642, '连接臂': 0.0033333333333333335, '升降气缸': 0.0024271844660194173, '移动装置': 0.0022624434389140274, '动力装置': 0.0015873015873015873, '放置槽': 0.0013227513227513227, '激光': 0.0012674271229404308, '导轨': 0.0003966679888932963, '固定板': 0.00018338529249954154}},

        'S-上下料口': {'FA': {'分拣': 0.009345794392523364}, 'FO': {}, 'S': {'前滑动槽': 0.3333333333333333, '后滑动槽': 0.3333333333333333, '冲板': 0.16666666666666666, '插板阀': 0.16666666666666666, '下料盘': 0.14285714285714285, '添加口': 0.1, '左支撑杆': 0.06666666666666667, '下料腔': 0.0625, '右支撑杆': 0.058823529411764705, '齿状结构': 0.05263157894736842, '转动口': 0.047619047619047616, '左连接杆': 0.047619047619047616, '右连接杆': 0.043478260869565216, '平移槽': 0.03125, '下料槽': 0.017543859649122806, '稳定杆': 0.013157894736842105, '存放腔': 0.012658227848101266, '料仓': 0.00909090909090909, '驱动槽': 0.008333333333333333, '驱动盘': 0.0072992700729927005, '软垫': 0.006622516556291391, '脚轮': 0.006493506493506494, '滚珠轴承': 0.006172839506172839, '出料孔': 0.005747126436781609, '下料管': 0.005681818181818182, '下料口': 0.0056179775280898875, '放置腔': 0.00510204081632653, '锁紧装置': 0.005076142131979695, '滑动孔': 0.004032258064516129, '缓冲垫': 0.002976190476190476, '转动盘': 0.0021551724137931034, '齿圈': 0.002044989775051125, '出料管': 0.0018018018018018018, '平台': 0.0017667844522968198, '支腿': 0.001564945226917058, '驱动杆': 0.0011876484560570072, '滑动杆': 0.0011235955056179776, '固定孔': 0.0009794319294809011, '磁铁': 0.0007189072609633358, '驱动轴': 0.0005773672055427252, '限位槽': 0.00040617384240454913, '挡板': 0.0002113718030014796, '支撑板': 0.00020296326364927948, '齿轮': 0.00014017381553125876, '滑块': 0.00011738466956215518, '电机': 8.096510404015869e-05}}
      }};

  },

  computed:{
    ...mapGetters(['fromDataSource']),
    ...mapState(['data']),
  },

  components:{
    From,
    MultFrom,
    Fromdraw,
    
  },

  methods:{

    //访问接口，传递修改后的数值
    async association(){
      console.log(this.fromDataSource)
      // 接口
      const path = '/cn_completion_1';
      await this.$http.post(path,{'result': this.fromDataSource})
        .then((res) => {
          this.semantic_sim_dict = {}
          this.semantic_sim_dict = res.data
          this.$refs.result.style.display = 'block'
        })
        .catch((error) => {
          // eslint-disable-next-line
          console.error(error);
        });
      // const {data: res} = await this.$http.post('http://127.0.0.1:5000/api/post',this.fromDataSource)
      // console.log(res)
      // this.semantic_sim_dict = res
      // console.log(this.semantic_sim_dict)
      // this.$refs.result.style.display = 'block'
      
    },

    formatData(e) {
      var resultitems = new Object()
      resultitems = this.semantic_sim_dict[e]
      console.log(resultitems)
      return resultitems
    },


    getresult(newVal){
      this.resultFromMultform =newVal
    },



    // 进行重要关键词的分析
    async anaylsisResultFromMult(){
      
      const path = '/cn_completion_2'
      // console.log(this.resultFromMultform)
      // const {data: res} = await this.$http.post('/api/post', this.resultFromMultform)
      // console.log(res)
      await this.$http.post(path,{'result': this.resultFromMultform})
        .then((res) => {
          // 获取需要的数据
          this.graphsimdictToDrawer = res.data

          // 判断是否进行了对应要素的选择
          let a = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'S')
          let b = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'FA')
          let c = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'FO')
          let d = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'scene') 
          if(!a){
            this.$message.warning('请确认所选择的结构域 (Structrue) 需求要素！');
            return
          }else if(!b){
            this.$message.warning('请确认所选择的功能域-行为(Function-Action) 需求要素！');
            return
          }else if(!c){
            this.$message.warning('请确认所选择的功能域-对象(Function-Object) 需求要素！');
            return
          }else if(!d){
            this.$message.warning('请确认所选择的场景域 (scene) 需求要素！');
            return
          }else{
            this.visible=true
            this.$message.success('进入关键词的分析');
          }

          
          this.resultToDrawer = this.resultFromMultform
          this.resultFromMultform = ''
        })
      //将获取到的信息传递给组件中对应属性
      // this.graphsimdictToDrawer = res
      
      // console.log(this.graphsimdictToDrawer)

      // let a = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'S')
      // let b = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'FA')
      // let c = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'FO')
      // let d = Object.prototype.hasOwnProperty.call(this.resultFromMultform,'scene') 
      // if(!a){
      //   this.$message.warning('请确认所选择的结构域 (Structrue) 需求要素！');
      //   return
      // }else if(!b){
      //   this.$message.warning('请确认所选择的功能域-行为(Function-Action) 需求要素！');
      //   return
      // }else if(!c){
      //   this.$message.warning('请确认所选择的功能域-对象(Function-Object) 需求要素！');
      //   return
      // }else if(!d){
      //   this.$message.warning('请确认所选择的场景域 (scene) 需求要素！');
      //   return
      // }else{
      //   this.visible=true
      //   this.$message.success('进入关键词的分析');
      // }
      // this.resultToDrawer = this.resultFromMultform
      // this.resultFromMultform = ''
    },

    afterVisibleChange(val) {
      console.log('visible', val);
    },

    
    onClose() {
      this.visible = false;
    },

    warning() {
      this.$message.warning('This is a warning message');
    },

  }  
}
</script>



<style scoped>
div {
  text-align: center;
}

hr{
  margin-bottom: 30px;
}

</style>